/*
A.
  int x=5;
  if(x>5)
  { 
     x-=4;
  }
  else 
  {
      x+=2;
  }

  το x είναι ίσο του 5 άλλα θα εκτελεστεί το σώμα εντολών της else
  επομένως x+=2;--->x=5+2=7.
B.
  int x=7;
  if(x>5)
  { 
      x-=4;
  }
  else 
  {
      x+=2; 
  }
 
  το x είναι μεγαλύτερο του 5 άρα θα εκτελεστεί το
  σώμα εντολών της if.
  x-=4;--->x=7-4=3.

Γ.
  int x=5;
  if (x>5)
  {  
      x-=4;
  }
  if (x<=5) 
  {
      x+=2;
  }

  το x είναι ίσο με πέντε επομένως θα εκτελεστεί το σώμα της δεύτερης if 
  x+=2-->x=5+2=7.Μόνη διαφορά με το Α. ότι στο συγκεκριμένο πρόγραμμα θα ελεγχούν 
  και οι 2 συνθήκες.

Δ.
  int x=7;
  if (x>5)
  { 
     x-=4;
  }
  if (x<=5) 
  {
     x+=2;
  }
  το x είναι μεγαλύτερη επομένως θα εκτελεστεί το σώμα της δεύτερης if 
  x-=4-->x=7-4=3.Μόνη διαφορά με το Β. ότι στο συγκεκριμένο πρόγραμμα θα ελεγχούν 
  και οι 2 συνθήκες,δηλαδή και η δεύτερη if,θα εξεταστεί ακόμη και αν ισχύει η πρώτη.

*/

#include <stdio.h>
#include <windows.h>

int main()
{
  SetConsoleOutputCP(65001);
  int x=5;
  if(x>5)
  { 
     x-=4;
  }
  else 
  {
      x+=2;
  }
  printf("Α:%d\n",x);
  Sleep(3000);
  x=7;
  if(x>5)
  { 
      x-=4;
  }
  else 
  {
      x+=2; 
  }
  printf("Β:%d\n",x);
  Sleep(3000);
  x=5;
  if (x>5)
  {  
      x-=4;
  }
  if (x<=5) 
  {
      x+=2;
  }
  printf("Γ:%d\n",x);
  Sleep(3000);
  x=7;
  if (x>5)
  { 
     x-=4;
  }
  if (x<=5) 
  {
     x+=2;
  }
  printf("Δ:%d\n",x);
  return 0;   
}