#include <stdio.h>  /* Το σύμβολο '#' πρέπει να προηγείται πάντα του include */ 
int main(void) /* Αυτή η εντολή δεν θέλει ';' στο τέλος της για να μπορέσει να λειτουργήσει σωστά */

{
	
    int m;
    int a  =  10; /* Η μεταβλητή a θα μπορούσε να δηλωθεί και μαζί με το m γιατί είναι ίδιου τύπου */

    m = 2*a+100; /* Για να πραγματοποιηθεί ένας πολλαπλασιασμός θα πρέπει να υπάρχει το '*' ανάμεσα στις μεταβλητές που αφορά */
    printf("%d\n",m); /* Για να εμφανιστεί το περιχόμενο μιας μεταβλητής, θα πρέπει αυτή να έχει δωθεί με το ίδιο όνομα με αυτό που δηλώθηκε */

    return 0; 

}
